[
    {
        "title": "Getting Started With Dart",
        "description": "The class is aimed at beginners who want to learn the basics of the Dart programming language with reference to industry standards. At the end of the class, students will be able to create Dart programs using the IntelliJ IDEA IDE or an Online IDE such as DartPad.",
        "tags": [
            "Dart Fundamental",
            "Control Flow",
            "Collection",
            "Object Oriented Programming",
            "Functional Styles",
            "Dart Type System",
            "Effective Dart"
        ],
        "github": "https://www.dicoding.com/certificates/JMZV4DNONXN9",
        "image": "/dart.png"
    },
    {
        "title": "Getting Started with Kotlin Programming",
        "description": "This class is intended for those who want to learn the basics of the Kotlin programming language by referring to the international competency standards of Google Developers Authorized Training Partners. At the end of the class, students understand the basic concepts of programming languages, functional programming, and object-oriented programming (OOP) using Kotlin.",
        "tags": [
            "Kotlin Fundamental",
            "Control Flow",
            "Collection",
            "Kotlin  OOP",
            "Kotlin Generics",
            "Special Classes",
            "Collections",
            "Coroutines"
        ],
        "github": "https://www.dicoding.com/certificates/GRX54N0JKP0M",
        "image": "/dasar_kotlin.png"
    },
    {
        "title": "Learn Fundamental Android Apllication",
        "description": "Classes are aimed at levelers who want to learn the fundamentals of making Android applications, such as networking and databases, with reference to the international competency standards of the Google Developers Authorized Training Partner. At the end of class, students can create applications that can retrieve data from the Web API and store favorite data using a local database.",
        "tags": [
            "Dasar Pengembangan Aplikasi Android",
            "Fragment",
            "Background Thread & Networking",
            "Android Architecture Component",
            "Navigation dan API",
            "Local Data Persistent",
            "Background Task dan Scheduler"
        ],
        "github": "https://www.dicoding.com/certificates/N9ZOYYE6DPG5",
        "image": "/fundamentalAndroid.png"
    },
    {
        "title": "Learn AI Basics",
        "description": "This class is intended for beginners who want to start a career in the world of AI. After taking the class, students are expected to be able to examine various basic concepts in AI and their applications well.",
        "tags": [
            "Berkenalan dengan Artificial Intelligence (AI)",
            "Data untuk AI",
            "Pengantar Machine Learning"
        ],
        "github": "https://www.dicoding.com/certificates/1OP846KJ8ZQK",
        "image": "/AI.png"
    },
    {
        "title": "Learn to Make Android Apps for Beginners",
        "description": "This class is intended for beginners who want to start their careers in the Android Developer field by referring to Googl's international competency standards. At the end of class, students can create an Android application that can display lists and data details.",
        "tags": [
            "Pengenalan Android Studio",
            "Activity",
            "Intent",
            "View dan ViewGroup",
            "Functional Styles",
            "Style dan Theme",
            "RecyclerView"
        ],
        "github": "https://www.dicoding.com/certificates/GRX54KGG2P0M",
        "image": "/andro_pemula.png"
    }
]
